Revit 2027 API
ColorFillScheme.GetFormatOptions Method
 Returns the FormatOptions of the scheme.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FormatOptions GetFormatOptions()
Public Function GetFormatOptions As FormatOptions
public:
FormatOptions^ GetFormatOptions()
member GetFormatOptions : unit -> FormatOptions
Return Value
FormatOptions
Remarks
 This method will return the default FormatOptions if the scheme is by value.
See Also
Reference
ColorFillScheme Class
Autodesk.Revit.DB Namespace